In [4]:
import pandas as pd

df = pd.read_csv("Iris.csv")

In [5]:
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [6]:
df['Species']

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: Species, Length: 150, dtype: object

In [7]:
df[['Id','Species']]

      Id         Species
0      1     Iris-setosa
1      2     Iris-setosa
2      3     Iris-setosa
3      4     Iris-setosa
4      5     Iris-setosa
..   ...             ...
145  146  Iris-virginica
146  147  Iris-virginica
147  148  Iris-virginica
148  149  Iris-virginica
149  150  Iris-virginica

[150 rows x 2 columns]

In [8]:
df.loc[0]
df.iloc[0]

Id                         1
SepalLengthCm            5.1
SepalWidthCm             3.5
PetalLengthCm            1.4
PetalWidthCm             0.2
Species          Iris-setosa
Name: 0, dtype: object

In [10]:
df.loc[1]

Id                         2
SepalLengthCm            4.9
SepalWidthCm             3.0
PetalLengthCm            1.4
PetalWidthCm             0.2
Species          Iris-setosa
Name: 1, dtype: object

In [13]:
data = {
    "Name" : ['sid','sam','san'],
    "Age" : [21,8,12]
}

df1 = pd.DataFrame(data, index=[1,2,3])
df1

  Name  Age
1  sid   21
2  sam    8
3  san   12

In [15]:
df1.loc[1]

Name    sid
Age      21
Name: 1, dtype: object

In [16]:
df1.iloc[1]

Name    sam
Age       8
Name: 2, dtype: object

In [17]:
df1.iloc[0]

Name    sid
Age      21
Name: 1, dtype: object

In [18]:
df1

  Name  Age
1  sid   21
2  sam    8
3  san   12

In [24]:
df1.loc[2,"Age"]

np.int64(8)

In [27]:
df1.iloc[2,0]

'san'

In [28]:
df1.at[1,'Name']

'sid'

In [29]:
df1.iat[0,0]

'sid'

In [31]:
df1[df1['Age']<15]

  Name  Age
2  sam    8
3  san   12

.query()

In [37]:
df1.query("Age>10")

  Name  Age
1  sid   21
3  san   12

In [42]:
df1.query("Name == 'sid'")

  Name  Age
1  sid   21

In [41]:
df1.query("Age > 15 and Name == 'sid'")

  Name  Age
1  sid   21